Session3_2017-08-28--2017-09-08/Serveur-web-Java-Intro.org
#+TITLE: Serveur web dynamique en Java : les bases
#+DATE: 
#+OPTIONS: ^:nil toc:2
#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}

#+BEGIN_SRC elisp :exports none :results silent
(org-babel-do-load-languages 'org-babel-load-languages '((ditaa . t))) 
  (add-to-list 'org-latex-packages-alist '("" "listings"))
  (add-to-list 'org-latex-packages-alist '("" "color"))
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)

  (setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "bibtex %b"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  (setq org-latex-minted-options '(("frame" "lines")
                                   ("fontsize" "\\scriptsize")
                                   ("xleftmargin" "\\parindent")
                                   ("linenos" "")))
#+END_SRC

* Pourquoi un serveur web en Java
** Pourquoi un serveur
Dans le cadre d'un système d'informations, on veut donner accès /simultané/ à des
informations à un nombre indéterminé d'utilisateurs.



** Pourquoi un serveur web
Un serveur web est en fait :
- un serveur internet ou intranet, c'est-à-dire utilisant les protocoles de transport TCP/IP
- utilisant le protocole de communication HTTP.

L'intérêt d'utiliser les protocoles TCP/IP est évidemment de tirer partie de
toute l'infrastructure réseau existante. L'intérêt d'utiliser HTTP est de tirer
parti de tous les logiciels/bibliothèques existantes, notamment les navigateurs web.

** Pourquoi un serveur web dynamique

Les informations gérées par le S.I. (Système d'Informations) peuvent être
modifiées par les utilisateurs. En conséquence, il faut que le serveur puisse
générer dynamiquement (en cours d'utilisation) les informations à envoyer. À
contrario, un site web statique ne pourrait que servir des informations figées.

** Pourquoi en Java
Java est un langage populaire pour la réalisation de sites web dynamiques pour
plusieurs raisons :

- concurrence/parallélisme :: Il est possible de gérer les connections de
     plusieurs utilisateurs en parallèle, tirant ainsi parti des architectures
     multi-cœurs des ordinateurs.
- performance :: En plus de tirer parti de tous les cœurs d'un ordinateur,
     chacun de ceux-ci est utilisé efficacement grâce à la performance de la
     JVM.
- portabilité :: Grâce à la JVM, un serveur programmé en Java peut facilement
     être déployé sur n'importe quelle architecture disposant d'une JVM. Cela
     permet notamment d'externaliser l'hébergement du site (cf. /cloud/, IaaS
     voire PaaS).
- fiabilité :: Le fait que Java soit un langage compilé à typage statique aide à
     la réalisation de programmes fiables, même si les erreurs de compilation
     *ne remplacent pas* les tests !
- disponiblitié de bibliothèques/frameworks :: Le fait que les autres qualités
     aient fait reconnaître l'intérêt d'utiliser Java pour la programmation de
     serveurs web a provoqué le développement de nombreuses bibliothèques et
     frameworks qui facilitent la programmation de serveurs.

* Principes de la programmations de serveurs dynamiques Web en Java

** TCP/IP et HTTP
TCP/IP permet de désigner une ressource à l'aide d'une URL. Cette URL indique :

- le protocole (HTTP/HTTPS)
- le nom du serveur (qui permet d'obtenir l'adresse IP grâce au DNS)
- le port (par défaut 80 pour un serveur web en HTTP et 443 pour le HTTPS)

Pour le port, on doit tenir compte du fait que les ports "de notoriété publique"
(/well known ports/), et notamment ceux qui nous intéressent, ne peuvent être
utilisés par un simple utilisateur et requiert donc les privilèges
administrateur. En pratique, on développera en utilisant un autre port
disponible pour les simples utilisateurs et libre. On rendra paramétrable au
déploiement le port utilisé par notre serveur. En effet, il ne peut y avoir
qu'un seul programme en charge d'un port donné sur un machine donnée. Pour cette
raison, on devra s'assurer de terminer le programme en court d'exécution avant
de le relancer lors du cycle de développement.

** Servlet, containers et serveurs embarqués

En Java, le composant de base de la programmation d'un serveur est une
/Servlet/. Il y a deux façons de déployer :
- Sous la forme d'un WAR à déployer sur un container de servlets lui-même déjà déployé (par exemple un Tomcat)
- Sous la forme d'un programme java autonome (JAR, le plus souvent "fat JAR"
  incluant toutes les dépendances), qui contient lui-même le serveur (par
  exemple Jetty).

De plus en plus, on préfère des livrables les plus autonomes possibles (par
exemple des machine virtuelles embarquant jusqu'au système d'exploitation !) et
par soucis de simplicité (pour ne pas avoir à installer de serveur Tomcat), on
commencera par utiliser un serveur Jetty embarqué. Ensuite, on utilisera un
framework qui permettra (notamment à l'aide de maven), de générer aussi bien un
fat JAR autonome qu'un WAR destiné à un container de Servlets.


* Embarquer un serveur Jetty

Ci-dessous, les étapes nécessaires pour la réalisation d'un serveur web minimal consultable sur un port donné (i.e. 9092)

** Configuration

On utilise Maven pour gérer les dépendances de nos projets. Pour réaliser un
serveur web embarquant Jetty, il suffit d'ajouter les dépendances =jetty-servlet= et =jetty-server= de =org.eclipse.jetty= dans
le fichier =pom.xml=. Par exemple :

#+BEGIN_SRC xml
	<dependency>
    <groupId>org.eclipse.jetty</groupId>
    <artifactId>jetty-server</artifactId>
    <version>9.4.6.v20170531</version>
</dependency>
<dependency>
    <groupId>org.eclipse.jetty</groupId>
    <artifactId>jetty-servlet</artifactId>
    <version>9.4.6.v20170531</version>
</dependency>
#+END_SRC

** Code de serveur Jetty élémentaire

On peut créer un objet de classe =org.eclipse.jetty.server.Server= associé à un
port disponible quelconque (par exemple =9092=). Ensuite, on utilise un objet de
classe =org.eclipse.jetty.servlet.ServletHandler= pour gérer les servlets qui
implémenteront notre serveur. Ensuite, on peut associer, dans ce =handler=, une
classe implémentant l'interface
[[https://docs.oracle.com/javaee/7/api/javax/servlet/Servlet.html][Servlet]] .
Ensuite, on lance le serveur dans un nouveau flux d'exécution concurrent et l'on
attend la fin de celui-ci :
#+BEGIN_SRC java
package co.simplon.poleEmploi.server;


import org.eclipse.jetty.server.*;
import org.eclipse.jetty.servlet.*;

public class HelloServer {
		
	 public static void main(String args[]) throws Exception{
	        Server server = new Server(9092);
	        ServletHandler handler = new ServletHandler();
	        server.setHandler(handler);
	        handler.addServletWithMapping(HelloGenericServlet.class, "/*");
	        server.start();
	        server.join();
	 }
}
#+END_SRC
