Session3_2017-08-28--2017-09-08/Serveur-web-Java-Intro.tex
% Created 2017-08-24 Thu 09:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{color}
\usepackage{listings}
\usepackage[frenchb]{babel}
\author{bernard}
\date{}
\title{Serveur web dynamique en Java : les bases}
\hypersetup{
 pdfauthor={bernard},
 pdftitle={Serveur web dynamique en Java : les bases},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.0)}, 
 pdflang={Frenchb}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents


\section{Pourquoi un serveur web en Java}
\label{sec:org6fe11ce}
\subsection{Pourquoi un serveur}
\label{sec:orge77076f}
Dans le cadre d'un système d'informations, on veut donner accès \emph{simultané} à des
informations à un nombre indéterminé d'utilisateurs.



\subsection{Pourquoi un serveur web}
\label{sec:org02b4d38}
Un serveur web est en fait :
\begin{itemize}
\item un serveur internet ou intranet, c'est-à-dire utilisant les protocoles de transport TCP/IP
\item utilisant le protocole de communication HTTP.
\end{itemize}

L'intérêt d'utiliser les protocoles TCP/IP est évidemment de tirer partie de
toute l'infrastructure réseau existante. L'intérêt d'utiliser HTTP est de tirer
parti de tous les logiciels/bibliothèques existantes, notamment les navigateurs web.

\subsection{Pourquoi un serveur web dynamique}
\label{sec:org7d2da29}

Les informations gérées par le S.I. (Système d'Informations) peuvent être
modifiées par les utilisateurs. En conséquence, il faut que le serveur puisse
générer dynamiquement (en cours d'utilisation) les informations à envoyer. À
contrario, un site web statique ne pourrait que servir des informations figées.

\subsection{Pourquoi en Java}
\label{sec:org72c1514}
Java est un langage populaire pour la réalisation de sites web dynamiques pour
plusieurs raisons :

\begin{description}
\item[{concurrence/parallélisme}] Il est possible de gérer les connections de
plusieurs utilisateurs en parallèle, tirant ainsi parti des architectures
multi-cœurs des ordinateurs.
\item[{performance}] En plus de tirer parti de tous les cœurs d'un ordinateur,
chacun de ceux-ci est utilisé efficacement grâce à la performance de la
JVM.
\item[{portabilité}] Grâce à la JVM, un serveur programmé en Java peut facilement
être déployé sur n'importe quelle architecture disposant d'une JVM. Cela
permet notamment d'externaliser l'hébergement du site (cf. \emph{cloud}, IaaS
voire PaaS).
\item[{fiabilité}] Le fait que Java soit un langage compilé à typage statique aide à
la réalisation de programmes fiables, même si les erreurs de compilation
\textbf{ne remplacent pas} les tests !
\item[{disponiblitié de bibliothèques/frameworks}] Le fait que les autres qualités
aient fait reconnaître l'intérêt d'utiliser Java pour la programmation de
serveurs web a provoqué le développement de nombreuses bibliothèques et
frameworks qui facilitent la programmation de serveurs.
\end{description}

\section{Principes de la programmations de serveurs dynamiques Web en Java}
\label{sec:orgb10e95a}

\subsection{TCP/IP et HTTP}
\label{sec:orgbd024f3}
TCP/IP permet de désigner une ressource à l'aide d'une URL. Cette URL indique :

\begin{itemize}
\item le protocole (HTTP/HTTPS)
\item le nom du serveur (qui permet d'obtenir l'adresse IP grâce au DNS)
\item le port (par défaut 80 pour un serveur web en HTTP et 443 pour le HTTPS)
\end{itemize}

Pour le port, on doit tenir compte du fait que les ports "de notoriété publique"
(\emph{well known ports}), et notamment ceux qui nous intéressent, ne peuvent être
utilisés par un simple utilisateur et requiert donc les privilèges
administrateur. En pratique, on développera en utilisant un autre port
disponible pour les simples utilisateurs et libre. On rendra paramétrable au
déploiement le port utilisé par notre serveur. En effet, il ne peut y avoir
qu'un seul programme en charge d'un port donné sur un machine donnée. Pour cette
raison, on devra s'assurer de terminer le programme en court d'exécution avant
de le relancer lors du cycle de développement.

\subsection{Servlet, containers et serveurs embarqués}
\label{sec:org443ec7b}

En Java, le composant de base de la programmation d'un serveur est une
\emph{Servlet}. Il y a deux façons de déployer :
\begin{itemize}
\item Sous la forme d'un WAR à déployer sur un container de servlets lui-même déjà déployé (par exemple un Tomcat)
\item Sous la forme d'un programme java autonome (JAR, le plus souvent "fat JAR"
incluant toutes les dépendances), qui contient lui-même le serveur (par
exemple Jetty).
\end{itemize}

De plus en plus, on préfère des livrables les plus autonomes possibles (par
exemple des machine virtuelles embarquant jusqu'au système d'exploitation !) et
par soucis de simplicité (pour ne pas avoir à installer de serveur Tomcat), on
commencera par utiliser un serveur Jetty embarqué. Ensuite, on utilisera un
framework qui permettra (notamment à l'aide de maven), de générer aussi bien un
fat JAR autonome qu'un WAR destiné à un container de Servlets.


\section{Embarquer un serveur Jetty}
\label{sec:org1146290}

Ci-dessous, les étapes nécessaires pour la réalisation d'un serveur web minimal consultable sur un port donné (i.e. 9092)

\subsection{Configuration}
\label{sec:org4830d3b}

On utilise Maven pour gérer les dépendances de nos projets. Pour réaliser un
serveur web embarquant Jetty, il suffit d'ajouter les dépendances \texttt{jetty-servlet} et \texttt{jetty-server} de \texttt{org.eclipse.jetty} dans
le fichier \texttt{pom.xml}. Par exemple :

\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{xml}
  <dependency>
    <groupId>org.eclipse.jetty</groupId>
    <artifactId>jetty-server</artifactId>
    <version>9.4.6.v20170531</version>
</dependency>
<dependency>
    <groupId>org.eclipse.jetty</groupId>
    <artifactId>jetty-servlet</artifactId>
    <version>9.4.6.v20170531</version>
</dependency>
\end{minted}

\subsection{Code de serveur Jetty élémentaire}
\label{sec:org1911ed8}

On peut créer un objet de classe \texttt{org.eclipse.jetty.server.Server} associé à un
port disponible quelconque (par exemple \texttt{9092}). Ensuite, on utilise un objet de
classe \texttt{org.eclipse.jetty.servlet.ServletHandler} pour gérer les servlets qui
implémenteront notre serveur. Ensuite, on peut associer, dans ce \texttt{handler}, une
classe implémentant l'interface
\href{https://docs.oracle.com/javaee/7/api/javax/servlet/Servlet.html}{Servlet} .
Ensuite, on lance le serveur dans un nouveau flux d'exécution concurrent et l'on
attend la fin de celui-ci :
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{java}
package co.simplon.poleEmploi.server;


import org.eclipse.jetty.server.*;
import org.eclipse.jetty.servlet.*;

public class HelloServer {

   public static void main(String args[]) throws Exception{
          Server server = new Server(9092);
          ServletHandler handler = new ServletHandler();
          server.setHandler(handler);
          handler.addServletWithMapping(HelloGenericServlet.class, "/*");
          server.start();
          server.join();
   }
}
\end{minted}
