Session3_2017-08-28--2017-09-08/Serveur-web-Java-Intro.org
** Code de Servlet HTTP élémentaire
Les servlets permettent d'implémenter tout types de serveurs, mais pour un
serveur HTTP, on utilisera plus précisément la classe
[[https://docs.oracle.com/javaee/7/api/javax/servlet/GenericServlet.html][javax.servlet.GenericServlet]] . Il suffit alors de définir la méthode [[https://docs.oracle.com/javaee/7/api/javax/servlet/GenericServlet.html#service-javax.servlet.ServletRequest-javax.servlet.ServletResponse-][service]].
Les arguments sont la requête et la réponse à construire. Pour cette dernière,
on utilise le fait que l'argument passé est une référence : les modifications
effectuées sur l'objet de classe [[https://docs.oracle.com/javaee/7/api/javax/servlet/ServletResponse.html][javax.servlet.ServletResponse]] seront
donc disponibles pour le code appelant.

#+BEGIN_SRC java
package co.simplon.poleEmploi.server;

import java.io.IOException;

import javax.servlet.GenericServlet;
import javax.servlet.ServletException;
import javax.servlet.ServletRequest;
import javax.servlet.ServletResponse;

public class HelloGenericServlet extends GenericServlet {
	private static final long serialVersionUID = 1L;
	@Override
	public void service(ServletRequest request, ServletResponse response) throws ServletException, IOException {
		    response.getWriter().println("Hello from HelloGenericServlet !\n"+"got:\n"+request);

	}

}
#+END_SRC

Il suffit ensuite de se rendre à l'aide d'un navigateur sur l'adresse
[[http://localhost:9092/]] . On peut aussi utiliser n'importe quel autre client :
#+BEGIN_SRC sh
wget --quiet http://localhost:9092/ -O /dev/stdout
#+END_SRC
ou
#+BEGIN_SRC sh
curl http://localhost:9092
#+END_SRC

** Notion de cycle de vie (lifecycle)

On remarque que l'argument de l'appel de la méthode [[https://www.eclipse.org/jetty/javadoc/9.4.6.v20170531/org/eclipse/jetty/servlet/ServletHandler.html#addServletWithMapping-java.lang.Class-java.lang.String-][addServletWithMapping]] n'est
pas une instance de notre classe =HelloGenericServlet= mais une instance d'une
classe générique [[http://docs.oracle.com/javase/8/docs/api/java/lang/Class.html?is-external=true][Class]] (!) qui représente une classe en Java, ici l'objet
représente notre classe =HelloGenericServlet=. Mais nous n'avons pas instancié
d'objet de cette classe avec un appel à =new=. C'est le serveur qui aura le
contrôle, [[https://docs.oracle.com/javaee/7/tutorial/servlets002.htm][entre autres]], de l'instanciation et de l'initialisation de l'objet
servlet.

* Serveur: inversion de contrôle, multithread

** Inversion de contrôle
Au niveau de l'architecture du code, il y a un changement fondamental entre les
programmes "classiques" en ligne de commande que nous avons implémentés jusqu'à
présent et les serveurs. En effet, lorsque les programmes "classiques" en ligne de
commande sont lancés, ils effectuent une tâche en demandant éventuellement à
l'environnement (utilisateur, disque, réseau, bases de données,…), des
informations avant de produire un résultat et de se terminer. Pour un serveur,
comme pour certaines applications avec une interface graphique, le programme n'a
pas l'initiative : il passe son temps à attendre des requêtes/évènements pour y
répondre. Le code qui implémente la réponse n'est pas appelé explicitement par
le programme principal, mais enregistré pour être appelé lorsqu'une requête/un
évènement survient. Parmi les conséquences de ce mécanisme, il y a le fait que les signatures
sont souvent prédéterminées. On pourrait être tenté de contourner cette
contrainte en utilisant des attributs en lecture et en écriture pour contourner
cette contrainte. Cependant, pour le cas des serveur, le fait que plusieurs
requêtes puissent arriver en même temps rend les modifications par /effets de
bord/ périlleuses, à cause des accès concurrent de la programmation multithread.


** Multithread, accès concurrents

Pour des raisons de qualité de service, on voudra évidemment pouvoir répondre à
plusieurs requêtes en même temps. Cela pose un problème particulier si
l'implémentation modifie un état partagé, en raison d'accès concurrents. En
Java, on utilise le multithread pour implémenter de façon performante les
serveurs, mais il faut alors soit éviter de modifier un état global, soit
synchroniser ces modifications comme on va le constater.

** Implémentation d'une servlet avec effet de bord

On va implémenter une servlet qui modifie des compteurs =counterA= et
=counterB=, transférant le contenu d'un compteur à l'autre. À chaque requête, un
compteur est décrémenté et l'autre est incrémenté, donc leur somme doit rester
constante. Si ce n'est pas le cas, on est dans une situation "impossible" et
l'on compte le nombre d'appels où le serveur était dans une telle situation :

#+BEGIN_SRC java
package co.simplon.poleEmploi.server;

import java.io.IOException;

import javax.servlet.GenericServlet;
import javax.servlet.ServletException;
import javax.servlet.ServletRequest;
import javax.servlet.ServletResponse;

public class StatefulServlet extends GenericServlet {
	private static final long serialVersionUID = 1L;
	public static final long SUM=10000;
	private long counterA= SUM;
	private long counterB=0;
	private boolean fromAToB= true;
	private long impossibleCounter=0;
	private long slowTransfert(final long v, final long delta) {
		System.err.println("slowTransfert called");
		return	v+delta;	
	}
    @Override
    public void service( ServletRequest request,
                          ServletResponse response ) throws ServletException,
                                                        IOException {
    	if (fromAToB) {
        	if(counterA > 0) {
        		counterB=slowTransfert(counterB, 1);
        		counterA=slowTransfert(counterA, -1);
        	}else {
        		fromAToB=false;
        	}
        }else {
        	if(counterB > 0) {
        		counterA=slowTransfert(counterA, 1);
        		counterB=slowTransfert(counterB, -1);
        	}else {
        		fromAToB= true;
        	}
        }
    	if((counterA+counterB) != SUM) {
        	++impossibleCounter;
        }
        response.getWriter().println("a= "+counterA+" b= "+counterB+" sum = "+
        (counterA+counterB)+"\n going from "+
        (fromAToB ? "A to B":"B to A")+"\n impossible count="+impossibleCounter+"\n");        
    }
}
#+END_SRC

Si l'on se rend à l'adresse [[http://localhost:9092/]], autant de fois que l'on
veut, le serveur semble fonctionner correctement. Mais si l'on décide de faire
un grand nombre de requêtes /en parallèle/, les comptes ne sont plus justes et le
serveur est dans un état "impossible" :
#+BEGIN_SRC sh
seq 100 |parallel -j 100 curl localhost:9092  &>/dev/null
#+END_SRC

- Comment expliquer cela ?
- Que se passe-t'il si l'on enlève l'appel à src_java[:exports
  code]{System.err.println("slowTransfert called");} ?
- Que se passe-t'il si à la place, on execute une requête vers une base de données ?


** Résolutions de problèmes d'accès concurrents

Une première solution pourrait être de /synchroniser/ la méthode =service=. On
peut pour cela utiliser le mot clé [[https://docs.oracle.com/javase/tutorial/essential/concurrency/syncmeth.html][synchronized]], mais quelles seraient les
conséquences ?

Quelle solution doit-on utiliser pour avoir un serveur acceptable ?

