Session3_2017-08-28--2017-09-08/Serveur-web-Java-Intro.org
* HTTP

Lorsque l'on implémente un serveur HTTP, on peut utiliser (dériver de-) la
classe [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServlet.html][javax.servlet.http.HttpServlet]] plutôt que la classe
[[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/GenericServlet.html][javax.servlet.GenericServlet]] afin d'avoir des méthodes plus spécifiques
correspondant aux différents /verbes/ ou /méthodes/ [[https://fr.wikipedia.org/wiki/Hypertext_Transfer_Protocol#M.C3.A9thodes][du protocole HTTP]], ainsi
qu'à des [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletRequest.html][requête]] et [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html][réponse]] spécifique prenant en compte diverses /méta-données/.


** Principales méthodes HTTP
On s'intéressera tout d'abord seulement aux méthodes HTTP utilisées pour
l'implémentation de sites/services web, en insistant sur celles qui sont
utilisables directement à partir de pages HTML: =GET= et =POST=.

*** GET

La méthode =GET= est celle qui est utilisée par un navigateur web lorsque l'on
visite une page web en indiquant une URL ou en cliquant sur un lien. Cela
correspond à la lecture des données associées à l'URL, sans modification des
informations stockées côté serveur.


*** POST

La méthode =POST= est celle qui est utilisée par un navigateur web lorsque l'on
envoie le contenu d'un formulaire. Cela correspond au cas général de l'envoi
d'informations qui vont avoir un effet côté serveur.

*** PUT

La méthode =PUT= concerne elle l'envoi des données qui correspondent à l'URL, en
réciproque de =GET=. Cette méthode doit être /idempotente/, c'est-à-dire qu'un
même =PUT= doit pouvoir être répété plusieurs fois sans que le résultat soit
différent côté serveur que si le =PUT= n'était fait qu'une seule fois. Pour
illustrer avec du code, l'instruction src_java[:exports code]{x= 4;} est
idempotente alors que src_java[:exports code]{x= x + 4;} ne l'est pas.

*** DELETE

La méthode =DELETE= concerne elle la suppression des données qui sont à l'URL concernée.

** Principales méta-données HTTP

*** Code de status
La première information qu'on peut considérer comme méta-donnée est le code de
statut qui accompagne la réponse du serveur. Tout le monde connaît sans doute le
fameux code 404 qui indique qu'il n'y a rien à l'URL indiquée, et il y a [[https://fr.wikipedia.org/wiki/Liste_des_codes_HTTP][tout
une liste de codes pour différents cas de figure]]. Lorsque l'on programme en
Java, on n'écrira bien sûr pas le code numérique mais l'on utilisera les
constantes nommées de la classe [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html][javax.servlet.http.HttpServletResponse]], comme
[[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#SC_OK][HttpServletResponse.SC_OK]] ou [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#SC_INTERNAL_SERVER_ERROR][HttpServletResponse.SC_INTERNAL_SERVER_ERROR]].

*** Entêtes (/headers/)

Aussi bien la requête que la réponse peuvent contenir des informations sous la
forme de entêtes. La [[https://en.wikipedia.org/wiki/List_of_HTTP_header_fields][liste des entêtes]] est longue d'autant qu'il est possible
d'ajouter des entêtes en plus de ceux qui sont standardisés. On s'intéressera
principalement aux suivants :

**** Content-Type
Cet entête indique le type de contenu qui est renvoyé. Par exemple du HTML, qui
est une sous-catégorie du texte, et l'encodage, par exemple l'utf-8:
=Content-Type: text/html; charset=utf-8=.

**** Set-Cookie
Cet entête permet d'enregistrer un [[https://fr.wikipedia.org/wiki/Cookie_(informatique)][cookie]] sur le client. Pour ajouter un cookie
à une réponse, on n'utilisera pas de méthode générique de type [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#addHeader(java.lang.String,%2520java.lang.String)][addHeader]] sur la
réponse, mais la méthode spécifique [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#addCookie(javax.servlet.http.Cookie)][addCookie]]. Il est possible d'ajouter
plusieurs cookies à une même réponse HTTP.


* Contenu statique et contenu dynamique

Le plus souvent, le contenu à envoyer en réponse à une requête n'est pas
purement dynamique. Évidemment, on voudra mettre le moins possible de données
dans le code, donc on voudra pouvoir aussi renvoyer le contenu de fichiers : il
s'agit de contenu statique.

** DefaultServlet

On peut envoyer le contenu de fichiers (ou de répertoires) correspondant à une
URL donnée en utilisant la class [[https://www.eclipse.org/jetty/javadoc/current/org/eclipse/jetty/servlet/DefaultServlet.html][DefaultServlet]] fournie par Jetty. Il est
possible de permettre ou non de renvoyer le contenu des répertoires lorsque
l'URL correspond à un répertoire et non un fichier.

** WelcomeFiles
Plutôt que de renvoyer le contenu d'un répertoire lorsqu'aucun nom de fichier
n'est indiqué dans l'URL, on veut renvoyer le contenu d'un fichier. On parle
alors de [[https://docs.oracle.com/cd/E19798-01/821-1841/bnaer/index.html][Welcome Files]]. On peut spécifier, par programmation ([[https://www.eclipse.org/jetty/javadoc/9.4.6.v20170531/org/eclipse/jetty/server/handler/ContextHandler.html#setWelcomeFiles-java.lang.String:A-][setWelcomeFiles]])
ou par configuration ([[https://www.javatpoint.com/welcome-file-list][dans web.xml]]), la liste ordonnée des noms de fichiers à
essayer pour trouver le contenu à renvoyer lorsqu'aucun fichier n'est indiqué
dans l'URL. On utilise pour cela le plus souvent le fichier =index.html= :
#+BEGIN_SRC java
	    String [] welcomeFiles = {"index.html"};
	    context.setWelcomeFiles(welcomeFiles);
	    context.setResourceBase("./src/main/resources/");
#+END_SRC

Comme on le voit, il ne faut pas oublier de spécifier le répertoire à partir
duquel rechercher les ressources, avec [[https://www.eclipse.org/jetty/javadoc/9.4.6.v20170531/org/eclipse/jetty/server/handler/ContextHandler.html#setResourceBase-java.lang.String-][setResourceBase]] ou en utilisant
[[https://www.eclipse.org/jetty/javadoc/9.4.6.v20170531/org/eclipse/jetty/servlet/Holder.html#setInitParameter-java.lang.String-java.lang.String-][setInitParameter]] sur le =ServletHolder= : src_java[:exports
code]{setInitParameter("dirAllowed","true")} ou src_java[:exports
code]{setInitParameter("dirAllowed","false")}.

* Utilisation d'une page HTML pour interagir avec le site



** Liens et formulaires
*** Requête GET avec balise <a>

Il suffit d'utiliser une balise =a= avec un lien =href= vers l'URL pour laquelle
on a associé une servlet :
#+BEGIN_SRC html
<a href="./dynamic">lien vers Servlet</a>
#+END_SRC 

