Session3_2017-08-28--2017-09-08/Serveur-web-Java-Intro.tex

\section{HTTP}
\label{sec:org944cbf0}

Lorsque l'on implémente un serveur HTTP, on peut utiliser (dériver de-) la
classe \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServlet.html}{javax.servlet.http.HttpServlet} plutôt que la classe
\href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/GenericServlet.html}{javax.servlet.GenericServlet} afin d'avoir des méthodes plus spécifiques
correspondant aux différents \emph{verbes} ou \emph{méthodes} \href{https://fr.wikipedia.org/wiki/Hypertext_Transfer_Protocol#M.C3.A9thodes}{du protocole HTTP}, ainsi
qu'à des \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletRequest.html}{requête} et \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html}{réponse} spécifique prenant en compte diverses \emph{méta-données}.


\subsection{Principales méthodes HTTP}
\label{sec:org40b1268}
On s'intéressera tout d'abord seulement aux méthodes HTTP utilisées pour
l'implémentation de sites/services web, en insistant sur celles qui sont
utilisables directement à partir de pages HTML: \texttt{GET} et \texttt{POST}.

\subsubsection{GET}
\label{sec:orgec39c94}

La méthode \texttt{GET} est celle qui est utilisée par un navigateur web lorsque l'on
visite une page web en indiquant une URL ou en cliquant sur un lien. Cela
correspond à la lecture des données associées à l'URL, sans modification des
informations stockées côté serveur.


\subsubsection{POST}
\label{sec:orga17ff40}

La méthode \texttt{POST} est celle qui est utilisée par un navigateur web lorsque l'on
envoie le contenu d'un formulaire. Cela correspond au cas général de l'envoi
d'informations qui vont avoir un effet côté serveur.

\subsubsection{PUT}
\label{sec:orgad00643}

La méthode \texttt{PUT} concerne elle l'envoi des données qui correspondent à l'URL, en
réciproque de \texttt{GET}. Cette méthode doit être \emph{idempotente}, c'est-à-dire qu'un
même \texttt{PUT} doit pouvoir être répété plusieurs fois sans que le résultat soit
différent côté serveur que si le \texttt{PUT} n'était fait qu'une seule fois. Pour
illustrer avec du code, l'instruction \mintinline[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{java}{x= 4;} est
idempotente alors que \mintinline[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{java}{x= x + 4;} ne l'est pas.

\subsubsection{DELETE}
\label{sec:orge22de11}

La méthode \texttt{DELETE} concerne elle la suppression des données qui sont à l'URL concernée.

\subsection{Principales méta-données HTTP}
\label{sec:org17f1f2b}

\subsubsection{Code de status}
\label{sec:org0848e2e}
La première information qu'on peut considérer comme méta-donnée est le code de
statut qui accompagne la réponse du serveur. Tout le monde connaît sans doute le
fameux code 404 qui indique qu'il n'y a rien à l'URL indiquée, et il y a \href{https://fr.wikipedia.org/wiki/Liste_des_codes_HTTP}{tout
une liste de codes pour différents cas de figure}. Lorsque l'on programme en
Java, on n'écrira bien sûr pas le code numérique mais l'on utilisera les
constantes nommées de la classe \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html}{javax.servlet.http.HttpServletResponse}, comme
\href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#SC_OK}{HttpServletResponse.SC\_OK} ou \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#SC_INTERNAL_SERVER_ERROR}{HttpServletResponse.SC\_INTERNAL\_SERVER\_ERROR}.

\subsubsection{Entêtes (\emph{headers})}
\label{sec:orgb445f01}

Aussi bien la requête que la réponse peuvent contenir des informations sous la
forme de entêtes. La \href{https://en.wikipedia.org/wiki/List_of_HTTP_header_fields}{liste des entêtes} est longue d'autant qu'il est possible
d'ajouter des entêtes en plus de ceux qui sont standardisés. On s'intéressera
principalement aux suivants :

\begin{enumerate}
\item Content-Type
\label{sec:org5ab5cde}
Cet entête indique le type de contenu qui est renvoyé. Par exemple du HTML, qui
est une sous-catégorie du texte, et l'encodage, par exemple l'utf-8:
\texttt{Content-Type: text/html; charset=utf-8}.

\item Set-Cookie
\label{sec:org1b46d3b}
Cet entête permet d'enregistrer un \href{https://fr.wikipedia.org/wiki/Cookie_(informatique)}{cookie} sur le client. Pour ajouter un cookie
à une réponse, on n'utilisera pas de méthode générique de type \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#addHeader(java.lang.String,\%2520java.lang.String)}{addHeader} sur la
réponse, mais la méthode spécifique \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServletResponse.html#addCookie(javax.servlet.http.Cookie)}{addCookie}. Il est possible d'ajouter
plusieurs cookies à une même réponse HTTP.
\end{enumerate}


\section{Contenu statique et contenu dynamique}
\label{sec:orgeab63ea}

Le plus souvent, le contenu à envoyer en réponse à une requête n'est pas
purement dynamique. Évidemment, on voudra mettre le moins possible de données
dans le code, donc on voudra pouvoir aussi renvoyer le contenu de fichiers : il
s'agit de contenu statique.

\subsection{DefaultServlet}
\label{sec:orga4a8617}

On peut envoyer le contenu de fichiers (ou de répertoires) correspondant à une
URL donnée en utilisant la class \href{https://www.eclipse.org/jetty/javadoc/current/org/eclipse/jetty/servlet/DefaultServlet.html}{DefaultServlet} fournie par Jetty. Il est
possible de permettre ou non de renvoyer le contenu des répertoires lorsque
l'URL correspond à un répertoire et non un fichier.

\subsection{WelcomeFiles}
\label{sec:orge41fb1f}
Plutôt que de renvoyer le contenu d'un répertoire lorsqu'aucun nom de fichier
n'est indiqué dans l'URL, on veut renvoyer le contenu d'un fichier. On parle
alors de \href{https://docs.oracle.com/cd/E19798-01/821-1841/bnaer/index.html}{Welcome Files}. On peut spécifier, par programmation (\href{https://www.eclipse.org/jetty/javadoc/9.4.6.v20170531/org/eclipse/jetty/server/handler/ContextHandler.html#setWelcomeFiles-java.lang.String:A-}{setWelcomeFiles})
ou par configuration (\href{https://www.javatpoint.com/welcome-file-list}{dans web.xml}), la liste ordonnée des noms de fichiers à
essayer pour trouver le contenu à renvoyer lorsqu'aucun fichier n'est indiqué
dans l'URL. On utilise pour cela le plus souvent le fichier \texttt{index.html} :
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{java}
String [] welcomeFiles = {"index.html"};
context.setWelcomeFiles(welcomeFiles);
context.setResourceBase("./src/main/resources/");
\end{minted}

Comme on le voit, il ne faut pas oublier de spécifier le répertoire à partir
duquel rechercher les ressources, avec \href{https://www.eclipse.org/jetty/javadoc/9.4.6.v20170531/org/eclipse/jetty/server/handler/ContextHandler.html#setResourceBase-java.lang.String-}{setResourceBase} ou en utilisant
\href{https://www.eclipse.org/jetty/javadoc/9.4.6.v20170531/org/eclipse/jetty/servlet/Holder.html#setInitParameter-java.lang.String-java.lang.String-}{setInitParameter} sur le \texttt{ServletHolder} : \mintinline[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{java}{setInitParameter("dirAllowed","true")} ou \mintinline[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{java}{setInitParameter("dirAllowed","false")}.

\section{Utilisation d'une page HTML pour interagir avec le site}
\label{sec:orgdb90ebd}



\subsection{Liens et formulaires}
\label{sec:org81d70ba}
\subsubsection{Requête GET avec balise <a>}
\label{sec:orgff0afbd}

Il suffit d'utiliser une balise \texttt{a} avec un lien \texttt{href} vers l'URL pour laquelle
on a associé une servlet :
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{html}
<a href="./dynamic">lien vers Servlet</a>
\end{minted}
