Session3_2017-08-28--2017-09-08/Serveur-web-Java-Intro.org
*** Requête POST avec un formulaire
On peut utiliser un formulaire avec le paramètre =method= à ="post"= et le
paramètre =action= indiquant l'URL pour laquelle on a associé une servlet :
#+BEGIN_SRC html
<form action="./dynamic" method="post">
    <div>
        <label for="nom">Nom :</label>
        <input type="text" id="name" name="name" />
    </div>
<div>
    Password: <input type="password" name="password"/> <br/>
</div>
    <div>
        <label for="courriel">Courriel :</label>
        <input type="email" id="email" name="email"/>
    </div>
    <div>
        <label for="message">Message :</label>
        <textarea id="message" name="message"></textarea>
    </div>
    <div class="button">
        <button type="submit">Envoyer votre message</button>
    </div>
</form>
#+END_SRC

Ensuite, on peut récupérer les paramètres côté serveur à partir de l'objet de
type =HttpServletRequest=, soit en récupérant le corps de la requête (/body/)
avec la méthode [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getReader()][getReader()]], ou (exclusif !) en utilisant les
méthodes [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getParameterMap()][getParameterMap()]] ou [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getParameterNames()][getParameterNames()]] et [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getParameterValues(java.lang.String)][getParameterValues(String
paramName)]].

** Javascript et méthodes HTTP
Si l'on veut utiliser d'autres méthodes (=PUT=, =DELETE=), il faut utiliser du code javascript.
Avec la bibliothèque =jQuery=, on peut par exemple écrire :
#+BEGIN_SRC html
<script>
  $(document).ready(function(){
    $('#DeleteButton').click(function(){
    	$.ajax({
    		  url: '/dynamic/data/123',
    		  method: 'DELETE'
    		})
    		  .done(function( data ) {
    		    console.log(data);
    		  });
    });
  });
</script>

<input type="button" value="deleteValue" id="DeleteButton" >
#+END_SRC

après avoir inclus la bibliothèque jQuery :
#+BEGIN_SRC html
<script
			  src="https://code.jquery.com/jquery-3.2.1.slim.min.js"
			  integrity="sha256-k2WSCIexGzOj3Euiig+TlR8gA0EmPjuc79OEeY5L45g="
			  crossorigin="anonymous"></script>
#+END_SRC

Côté serveur, il faut bien sûr implémenter la méthode [[https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServlet.html#doDelete(javax.servlet.http.HttpServletRequest,%2520javax.servlet.http.HttpServletResponse)][doDelete]].

Pour voir le résultat, il faut afficher la console du navigateur.

On peut faire la même chose avec une méthode =PUT=.

* Documents dynamique

On a vu qu'on pouvait retourner une chaîne de caractère construite dynamiquement
par une servlet, ou que l'on pouvait retourner le contenu d'un fichier. Parfois,
on voudra pouvoir générer dynamiquement des fragment d'un document dont la mise
en page sera, elle, statique. On utilise généralement pour cela des mécanismes
de /templating/, par exemple avec de JSP (/Java Server Pages/).

* Du site web dynamique à la webapp

Si l'on désire implémenter un client /CRUD/ (/Create/, /Read/, /Update/, /Delete/):

- quelles méthodes HTTP semblent pertinentes ?
- quelles URLs semblent pertinentes (cf RESTful) ?
- quel format de données semble pertinent ?
