Session3_2017-08-28--2017-09-08/Serveur-web-Java-Intro.tex

\subsubsection{Requête POST avec un formulaire}
\label{sec:org96b359f}
On peut utiliser un formulaire avec le paramètre \texttt{method} à \texttt{"post"} et le
paramètre \texttt{action} indiquant l'URL pour laquelle on a associé une servlet :
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{html}
<form action="./dynamic" method="post">
    <div>
        <label for="nom">Nom :</label>
        <input type="text" id="name" name="name" />
    </div>
<div>
    Password: <input type="password" name="password"/> <br/>
</div>
    <div>
        <label for="courriel">Courriel :</label>
        <input type="email" id="email" name="email"/>
    </div>
    <div>
        <label for="message">Message :</label>
        <textarea id="message" name="message"></textarea>
    </div>
    <div class="button">
        <button type="submit">Envoyer votre message</button>
    </div>
</form>
\end{minted}

Ensuite, on peut récupérer les paramètres côté serveur à partir de l'objet de
type \texttt{HttpServletRequest}, soit en récupérant le corps de la requête (\emph{body})
avec la méthode \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getReader()}{getReader()}, ou (exclusif !) en utilisant les
méthodes \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getParameterMap()}{getParameterMap()} ou \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getParameterNames()}{getParameterNames()} et \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/ServletRequest.html#getParameterValues(java.lang.String)}{getParameterValues(String
paramName)}.

\subsection{Javascript et méthodes HTTP}
\label{sec:orgee56324}
Si l'on veut utiliser d'autres méthodes (\texttt{PUT}, \texttt{DELETE}), il faut utiliser du code javascript.
Avec la bibliothèque \texttt{jQuery}, on peut par exemple écrire :
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{html}
<script>
  $(document).ready(function(){
    $('#DeleteButton').click(function(){
      $.ajax({
          url: '/dynamic/data/123',
          method: 'DELETE'
        })
          .done(function( data ) {
            console.log(data);
          });
    });
  });
</script>

<input type="button" value="deleteValue" id="DeleteButton" >
\end{minted}

après avoir inclus la bibliothèque jQuery :
\begin{minted}[frame=lines,fontsize=\scriptsize,xleftmargin=\parindent,linenos]{html}
<script
        src="https://code.jquery.com/jquery-3.2.1.slim.min.js"
        integrity="sha256-k2WSCIexGzOj3Euiig+TlR8gA0EmPjuc79OEeY5L45g="
        crossorigin="anonymous"></script>
\end{minted}

Côté serveur, il faut bien sûr implémenter la méthode \href{https://tomcat.apache.org/tomcat-5.5-doc/servletapi/javax/servlet/http/HttpServlet.html#doDelete(javax.servlet.http.HttpServletRequest,\%2520javax.servlet.http.HttpServletResponse)}{doDelete}.

Pour voir le résultat, il faut afficher la console du navigateur.

On peut faire la même chose avec une méthode \texttt{PUT}.

\section{Documents dynamique}
\label{sec:org0f83d32}

On a vu qu'on pouvait retourner une chaîne de caractère construite dynamiquement
par une servlet, ou que l'on pouvait retourner le contenu d'un fichier. Parfois,
on voudra pouvoir générer dynamiquement des fragment d'un document dont la mise
en page sera, elle, statique. On utilise généralement pour cela des mécanismes
de \emph{templating}, par exemple avec de JSP (\emph{Java Server Pages}).

\section{Du site web dynamique à la webapp}
\label{sec:org33dac4f}

Si l'on désire implémenter un client \emph{CRUD} (\emph{Create}, \emph{Read}, \emph{Update}, \emph{Delete}):

\begin{itemize}
\item quelles méthodes HTTP semblent pertinentes ?
\item quelles URLs semblent pertinentes (cf RESTful) ?
\item quel format de données semble pertinent ?
\end{itemize}
\end{document}